JazzJackson0/Embedded-Library/STM32F407-STM32F446/Drivers/STM32F407.CAN.h
//STM32F407 Driver
#ifndef CAN_H_
#define CAN_H_
#include <stdint.h>
#include <stdlib.h>
#include "STM32F407.GPIO.h"

typedef enum _FilterSize E_FilterSize;
typedef enum _FilterMode E_FilterMode;
typedef union _Data Received_Data;
typedef struct _filter Filter;

//DECLARATIONS
/**
 * @brief Set CAN Bit Rate
 * 			|||  1 Mbps Bit Rate Example:
 *				|||  Prescaler = 1
 *				|||  Num of Time Quanta = 16
 *					||| (a) Resync Jump Width = 1 (Always 1)
 *					||| (b) Seg 1 = 13
 *					||| (c) Seg 2 = 2
 *					||| (d) 1 + 13 + 2 = 16
 *				|||  Obtained from bittiming.can
 * 
 * @param canNum CAN Number (1 - 2)
 * @param baudRatePrescale BaudRate Prescaler
 * @param resyncJump Resync Jump Widtth
 * @param timeSeg1 Time Segment 1
 * @param timeSeg2 Time Segment 2
 * @return ** void 
 */
void CAN_SetBitTime(uint8_t canNum, uint8_t baudRatePrescale, uint8_t resyncJump, 
	uint8_t timeSeg1, uint8_t timeSeg2);
/**
 * @brief Set Up CAN Acceptance Filter
 * 
 * @param canNum CAN Number (1 - 2)
 * @param filterInfo Struct containing CAN Acceptance Filter Information
 * @return ** void 
 */
void CAN_SetAcceptanceFilter(uint8_t canNum, Filter *filterInfo);
/**
 * @brief Set Up CAN TX Mailbox
 * 
 * @param canNum CAN Number (1 - 2)
 * @param mailboxNum Mailbox Number (0 - 2)
 * @param standardID Mailbox Acceptance Filter ID
 * @param numOfBytes Mailbox Data Transmission Size (0 Bytes - 8 Bytes)
 * @return ** void 
 */
void CAN_SetTXMailbox(uint8_t canNum, uint8_t mailboxNum, uint64_t standardID, uint8_t numOfBytes);
/**
 * @brief Set Up CAN RX Mailbox
 * 
 * @param canNum CAN Number (1 - 2)
 * @param mailboxNum Mailbox Number (0 - 2)
 * @param standardID Mailbox Acceptance Filter ID
 * @param numOfBytes Mailbox Data Reception Size (0 Bytes - 8 Bytes)
 * @return ** void 
 */
void CAN_SetRXMailbox(uint8_t canNum, uint8_t mailboxNum, uint64_t standardID, uint8_t numOfBytes);
/**
 * @brief Initialize and Start CAN
 * 
 * @param canNum CAN Number (1 - 2)
 * @return ** void 
 */
void CAN_Init_and_Start(uint8_t canNum);
/**
 * @brief Transmit Data via CAN
 * 
 * @param canNum CAN Number (1 - 2)
 * @param mailboxNum Mailbox Number (0 - 2)
 * @param dataBuffer Data to transmit
 * @param numOfBytes Number of Bytes to Transmit
 * @return ** uint8_t 
 */
uint8_t CAN_Transmit(uint8_t canNum, uint8_t mailboxNum, uint8_t *dataBuffer, uint8_t numOfBytes);
/**
 * @brief Receive Data via CAN
 * 
 * @param canNum CAN Number (1 - 2)
 * @param mailboxNum Mailbox Number (0 - 2)
 * @param numOfBytes Number of Bytes to Receive
 * @return ** Received_Data* 
 */
Received_Data* CAN_Receive(uint8_t canNum, uint8_t mailboxNum, uint8_t numOfBytes);

//CLOCK
#define CLOCK 0x40023800
#define APB1 0x40
#define ADDR_CAN_CLOCK ( (CAN_CLOCK*) ((CLOCK) + APB1) )

//CANx
typedef struct _can CANx;
typedef struct _mailbox_filters MAIL_FILTERSx;
typedef union _filterBanks FILTER_BANKSx;
#define CAN_BASE 0x40006000
//
#define ADDR_CAN1 ( (CANx*) ((CAN_BASE) + 0x400) )
#define ADDR_CAN1_MAIL_FILTERS ( (MAIL_FILTERSx*) ((CAN_BASE) + (0x400 + 0x180)) )
#define ADDR_CAN1_FILTERBANKS ( (FILTER_BANKSx*) ((CAN_BASE) + (0x400 + 0x240) ) )
//
#define ADDR_CAN2 ( (CANx*) ((CAN_BASE) + 0x800) )
#define ADDR_CAN2_MAIL_FILTERS ( (MAIL_FILTERSx*) ((CAN_BASE) + (0x800 + 0x180)) )
#define ADDR_CAN2_FILTERBANKS ( (FILTER_BANKSx*) ((CAN_BASE) + (0x400 + 0x2B0) ) )

//Enums----------------------------------------------------------------------

//CAN_FILTER_SCALE
enum _FilterSize {
	_16BIT_CAN = 0, _32BIT_CAN = 1
};

//CAN_FILTER_MODE
enum _FilterMode {
	MASK_MODE = 0, LIST_MODE = 1
};

//Structs----------------------------------------------------------------------
//Filter

/**
 * @brief |||  filterNum: Filter 0 - Filter 27 |||  filterSize: 16-Bit or 32-Bit 
 * 		|||  filterMode: Mask Mode or List Mode |||  filterBankVal: Acceptance 
 * 			Filter Bank Value (Standard ID will be compared to this) 
 * 		|||  filterBankRegNum: Filter Bank Reg 1 or 2|||  fifoNum: FIFO 0 or FIFO 1
 */
struct _filter{
	uint8_t filterNum; // Filter 0 - Filter 27
	E_FilterSize filterSize; // _16BIT_CAN or _32BIT_CAN 
	E_FilterMode filterMode; // MASK_MODE or LIST_MODE
	uint64_t filterBankVal; // Acceptance Filter Bank Value (Standard ID will be compared to this) 
	uint8_t filterBankRegNum; // Filter Bank Reg 1 or 2
	uint8_t fifoNum; // FIFO 0 or FIFO 1
};

//Byte Container
union _Data {
	struct {
		uint8_t byte0;
		uint8_t byte1;
		uint8_t byte2;
		uint8_t byte3;
		uint8_t byte4;
		uint8_t byte5;
		uint8_t byte6;
		uint8_t byte7;
	};
	
	uint8_t dataIterator[8];
};

//CAN_ERRORSTATUS
/*Most recent error code*/
#define NO_ERROR 0x00
#define STUFF_ERROR 0x01
#define FORM_ERROR 0x02
#define ACK_ERROR 0x03
#define BIT_RECESSIVE_ERROR 0x04
#define BIT_DOMINANT_ERROR 0x05
#define CRC_ERROR 0x06
#define SETBY_SOFTWARE 0x07

// Registers-----------------------------------------------------------------
struct _can {
	CAN_MASTER_CONTROL MasterControlReg; // 0x00
	CAN_MASTER_SATUS MasterStatusReg; // 0x04
	CAN_TRANSMIT_STATUS TransmitStatReg; // 0x08
	CAN_RECEIVE_FIFO0 RXFIFOReg1; // 0x0C
	CAN_RECEIVE_FIFO1 RXFIFOReg2; // 0x10
	CAN_INTERRUPTS InterruptsReg; // 0x14
	CAN_ERRORSTATUS ErrorStatusReg; // 0x18
	CAN_BITTIMING BitTimingReg; // 0x1C
};

struct _mailbox_filters {
	CAN_TX_MAILBOX_IDENTIFIER TXMailBox0IDReg; //0x180
	CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP TXMaiBox0DataLenCtrlTimeStampReg; //0x184
	CAN_TX_MAILBOX_DATALOW TXMailBox0DataLowReg; //0x188
	CAN_TX_MAILBOX_DATAHIGH TXMailBox0DataHighReg; //0x18C

	CAN_TX_MAILBOX_IDENTIFIER TXMailBox1IDReg; //0x190
	CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP TXMaiBox1DataLenCtrlTimeStampReg; //0x194
	CAN_TX_MAILBOX_DATALOW TXMailBox1DataLowReg; //0x198
	CAN_TX_MAILBOX_DATAHIGH TXMailBox1DataHighReg; //0x19C

	CAN_TX_MAILBOX_IDENTIFIER TXMailBox2IDReg; //0x1A0
	CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP TXMaiBox2DataLenCtrlTimeStampReg; //0x1A4
	CAN_TX_MAILBOX_DATALOW TXMailBox2DataLowReg; //0x1A8
	CAN_TX_MAILBOX_DATAHIGH TXMailBox2DataHighReg; //0x1AC
	
	CAN_RX_MAILBOX_IDENTIFIER RXMailBox0IDReg; //0x1B0
	CAN_RX_MAILBOX_DATALENCNTRL_TIMESTAMP RXMaiBox0DataLenCtrlTimeStampReg; //0x1B4
	CAN_RX_MAILBOX_DATALOW RXMailBox0DataLowReg; //0x1B8
	CAN_RX_MAILBOX_DATAHIGH RXMailBox0DataHighReg; //0x1BC

