JazzJackson0/Embedded-Library/STM32F407-STM32F446/Drivers/STM32F407.CAN.h
	CAN_RX_MAILBOX_IDENTIFIER RXMailBox1IDReg; //0x1C0
	CAN_RX_MAILBOX_DATALENCNTRL_TIMESTAMP RXMaiBox1DataLenCtrlTimeStampReg; //0x1C4
	CAN_RX_MAILBOX_DATALOW RXMailBox1DataLowReg; //0x1C8
	CAN_RX_MAILBOX_DATAHIGH RXMailBox1DataHighReg; //0x1CC
	CAN_RESERVED reserved0; // 0x1D0
	CAN_RESERVED reserved1; // 0x1D4
	CAN_RESERVED reserved2; // 0x1D8
	CAN_RESERVED reserved3; // 0x1DC
	CAN_RESERVED reserved4; // 0x1E0
	CAN_RESERVED reserved5; // 0x1E4
	CAN_RESERVED reserved6; // 0x1E8
	CAN_RESERVED reserved7; // 0x1EC
	CAN_RESERVED reserved8; // 0x1F0
	CAN_RESERVED reserved9; // 0x1F4
	CAN_RESERVED reserved10; // 0x1F8
	CAN_RESERVED reserved11; // 0x1FC
	CAN_FILTER_MASTER FilterMasterReg; // 0x200
	CAN_FILTER_MODE FilterModeReg; // 0x204
	CAN_RESERVED reserved12; // 0x208
	CAN_FILTER_SCALE FilterScaleReg; // 0x20C
	CAN_RESERVED reserved13; // 0x210
	CAN_FILTER_FIFO_ASSIGNMENT FilterFIFOAssignReg; // 0x214
	CAN_RESERVED reserved14; // 0x218
	CAN_FILTER_ACTIVATION FilterActivationReg; // 0x21C
	CAN_RESERVED reserved15; // 0x220
	CAN_RESERVED reserved16; // 0x224
	CAN_RESERVED reserved17; // 0x228
	CAN_RESERVED reserved18; // 0x22C
	CAN_RESERVED reserved19; // 0x230
	CAN_RESERVED reserved20; // 0x234
	CAN_RESERVED reserved21; // 0x238
	CAN_RESERVED reserved22; // 0x23C
};

union _filterBanks {
	struct  {
		CAN_FILTERBANKi_REGISTERx FilterBank0; // Reg1: 0x240 | Reg2: 0x2B0
		CAN_FILTERBANKi_REGISTERx FilterBank1; // Reg1: 00x244 | Reg2: 0x2B4
		CAN_FILTERBANKi_REGISTERx FilterBank2; // Reg1: 00x248 | Reg2: 0x2B8
		CAN_FILTERBANKi_REGISTERx FilterBank3; // Reg1: 00x24C | Reg2: 0x2BC
		CAN_FILTERBANKi_REGISTERx FilterBank4; // Reg1: 00x250 | Reg2: 0x2C0
		CAN_FILTERBANKi_REGISTERx FilterBank5; // Reg1: 00x254 | Reg2: 0x2C4
		CAN_FILTERBANKi_REGISTERx FilterBank6; // Reg1: 00x258 | Reg2: 0x2C8
		CAN_FILTERBANKi_REGISTERx FilterBank7; // Reg1: 00x25C | Reg2: 0x2CC
		CAN_FILTERBANKi_REGISTERx FilterBank8; // Reg1: 00x260 | Reg2: 0x2D0
		CAN_FILTERBANKi_REGISTERx FilterBank9; // Reg1: 00x264 | Reg2: 0x2D4
		CAN_FILTERBANKi_REGISTERx FilterBank10; // Reg1: 00x268 | Reg2: 0x2D8
		CAN_FILTERBANKi_REGISTERx FilterBank11; // Reg1: 00x26C | Reg2: 0x2DC
		CAN_FILTERBANKi_REGISTERx FilterBank12; // Reg1: 00x270 | Reg2: 0x2E0
		CAN_FILTERBANKi_REGISTERx FilterBank13; // Reg1: 00x274 | Reg2: 0x2E4
		CAN_FILTERBANKi_REGISTERx FilterBank14; // Reg1: 00x278 | Reg2: 0x2E8
		CAN_FILTERBANKi_REGISTERx FilterBank15; // Reg1: 00x27C | Reg2: 0x2EC
		CAN_FILTERBANKi_REGISTERx FilterBank16; // Reg1: 00x280 | Reg2: 0x2F0
		CAN_FILTERBANKi_REGISTERx FilterBank17; // Reg1: 00x284 | Reg2: 0x2F4
		CAN_FILTERBANKi_REGISTERx FilterBank18; // Reg1: 00x288 | Reg2: 0x2F8
		CAN_FILTERBANKi_REGISTERx FilterBank19; // Reg1: 00x28C | Reg2: 0x2FC
		CAN_FILTERBANKi_REGISTERx FilterBank20; // Reg1: 00x290 | Reg2: 0x300
		CAN_FILTERBANKi_REGISTERx FilterBank21; // Reg1: 00x294 | Reg2: 0x304
		CAN_FILTERBANKi_REGISTERx FilterBank22; // Reg1: 00x298 | Reg2: 0x308
		CAN_FILTERBANKi_REGISTERx FilterBank23; // Reg1: 00x29C | Reg2: 0x30C
		CAN_FILTERBANKi_REGISTERx FilterBank24; // Reg1: 00x2A0 | Reg2: 0x310
		CAN_FILTERBANKi_REGISTERx FilterBank25; // Reg1: 00x2A4 | Reg2: 0x314
		CAN_FILTERBANKi_REGISTERx FilterBank26; // Reg1: 00x2A8 | Reg2: 0x318
		CAN_FILTERBANKi_REGISTERx FilterBank27; // Reg1: 00x2AC | Reg2: 0x31C
	};

	CAN_FILTERBANKi_REGISTERx Banks[28];
};


//Clock Register-------------------------------------------------------------
typedef struct {
	const uint32_t reserved0:25;
	volatile uint32_t can1_StartTick:1;
	volatile uint32_t can2_StartTick:1;
	const uint32_t reserved1:5;
}CAN_CLOCK;


//CONTROL & STATUS REGISTERS-----------------------------------------------
typedef struct {
	const uint32_t reserved1:32;
}CAN_RESERVED;

typedef struct {
	volatile uint32_t send_InitializeModeRequest:1;
	volatile uint32_t send_SleepModeRequest:1;
	volatile uint32_t txOrderIdentifier0_txOrderChronological1:1;
	volatile uint32_t enable_LockRXWhenFull:1;
	volatile uint32_t disable_AutoRetransmit:1;
	volatile uint32_t enable_AutoWakeUp:1;
	volatile uint32_t enable_AutoExitBusOffState:1;
	volatile uint32_t enable_TimeTriggeredCommMode:1;
	const uint32_t reserved0:7;
	volatile uint32_t resetMaster_thenSleep:1;
	volatile uint32_t enable_FreezeDuringDebug:1;
	const uint32_t reserved:15;
}CAN_MASTER_CONTROL;

typedef struct {
	volatile uint32_t initializeModeRequestAccepted:1;
	volatile uint32_t sleepModeRequestAccepted:1;
	volatile uint32_t errorDetected:1;
	volatile uint32_t wakeUpDetected:1;
	volatile uint32_t inSleepMode:1;
	const uint32_t reserved0:3;
	volatile uint32_t inTransmitMode:1;
	volatile uint32_t inReceiveMode:1;
	volatile uint32_t rxVal_LastSamplePoint:1;
	volatile uint32_t rxSignal:1;
	const uint32_t reserved:20;
}CAN_MASTER_SATUS;

typedef struct {
	volatile uint32_t mailbox0_RequestCompleted:1;
	volatile uint32_t mailbox0_TransmitSuccess:1;
	volatile uint32_t mailbox0_ArbitrationLost:1;
	volatile uint32_t mailbox0_TransmitError:1;
	const uint32_t reserved0:3;
	volatile uint32_t send_Mailbox0TransmitAbortRequest:1;
	volatile uint32_t mailbox1_RequestCompleted:1;
	volatile uint32_t mailbox1_TransmitSuccess:1;
	volatile uint32_t mailbox1_ArbitrationLost:1;
	volatile uint32_t mailbox1_TransmitError:1;
	const uint32_t reserved1:3;
	volatile uint32_t send_Mailbox1TransmitAbortRequest:1;
	volatile uint32_t mailbox2_RequestCompleted:1;
	volatile uint32_t mailbox2_TransmitSuccess:1;
	volatile uint32_t mailbox2_ArbitrationLost:1;
	volatile uint32_t mailbox2_TransmitError:1;
	const uint32_t reserved2:3;
	volatile uint32_t send_Mailbox2TransmitAbortRequest:1;
	volatile uint32_t freeMailbox:2;
	volatile uint32_t mailbox0_NoTransmitRequestPending:1;
	volatile uint32_t mailbox1_NoTransmitRequestPending:1;
	volatile uint32_t mailbox2_NoTransmitRequestPending:1;
	volatile uint32_t mailbox0_HasLowestPriority:1;
	volatile uint32_t mailbox1_HasLowestPriority:1;
	volatile uint32_t mailbox2_HasLowestPriority:1;
}CAN_TRANSMIT_STATUS;

typedef struct {
	volatile uint32_t numOfMessagesWaitingInFIFO0:2;
	const uint32_t reserved0:1;
	volatile uint32_t messageFIFO0_Full:1;
	volatile uint32_t messageFIFO0_Overrun:1;
	volatile uint32_t release_FIFO0_OutputMailbox:1;
	const uint32_t reserved1:26;
}CAN_RECEIVE_FIFO0;

