JazzJackson0/Embedded-Library/STM32F407-STM32F446/Drivers/STM32F407.CAN.h
typedef struct {
	volatile uint32_t numOfMessagesWaitingInFIFO1:2;
	const uint32_t reserved0:1;
	volatile uint32_t messageFIFO1_Full:1;
	volatile uint32_t messageFIFO1_Overrun:1;
	volatile uint32_t release_FIFO1_OutputMailbox:1;
	const uint32_t reserved1:26;
}CAN_RECEIVE_FIFO1;

typedef struct {
	volatile uint32_t enable_TransmitMailboxEmptyInterrupt:1;
	volatile uint32_t enable_FIFO0MessagePendingInterrupt:1;
	volatile uint32_t enable_FIFO0FullInterrupt:1;
	volatile uint32_t enable_FIFO0OverrunInterrupt:1;
	volatile uint32_t enable_FIFO1MessagePendingInterrupt:1;
	volatile uint32_t enable_FIFO1FullInterrupt:1;
	volatile uint32_t enable_FIFO1OverrunInterrupt:1;
	const uint32_t reserved0:1;
	volatile uint32_t enable_ErrorWarningInterrupt:1;
	volatile uint32_t enable_ErrorPassiveInterrupt:1;
	volatile uint32_t enable_BusOffInterrupt:1;
	volatile uint32_t enable_LastErrorCodeInterrupt:1;
	const uint32_t reserved1:3;
	volatile uint32_t enable_ErrorInterrupt:1;
	volatile uint32_t enable_WakeupInterrupt:1;
	volatile uint32_t enable_SleepInterrupt:1;
	const uint32_t reserved2:14;
}CAN_INTERRUPTS;

typedef struct {
	volatile uint32_t errorWarning:1;
	volatile uint32_t ErrorPassive:1;
	volatile uint32_t busOff:1;
	const uint32_t reserved0:1;
	volatile uint32_t mostRecentErrorCode:3;
	const uint32_t reserved1:9;
	volatile uint32_t numOfTransmitErrors:8;
	volatile uint32_t numOfReceiveErrors:8;
}CAN_ERRORSTATUS;

typedef struct {
	volatile uint32_t rw_BaudRatePrescaler:10;
	const uint32_t reserved0:6;
	volatile uint32_t rw_TimeSegment1:4; //No Macros available
	volatile uint32_t rw_TimeSegment2:3; //No Macros available
	const uint32_t reserved1:1;
	volatile uint32_t rw_ReSyncJumpWidth:2; //No Macros available
	const uint32_t reserved2:4;
	volatile uint32_t enable_LoopbackMode:1;
	volatile uint32_t enable_SilentMode:1;
}CAN_BITTIMING;


//MAILBOX REGISTERS-------------------------------------------------------
typedef union {
	
	struct {
		volatile uint32_t request_TransmissionFromMailbox:1;
		volatile uint32_t enable_RemoteFrame:1;
		volatile uint32_t enable_ExtendedIdentifier:1;
		volatile uint32_t rw_ExtendedIdentifier:26;
		const uint32_t reserved:3;
	}ExtendedIdentifier;

	struct {
		volatile uint32_t request_TransmissionFromMailbox:1;
		volatile uint32_t enable_RemoteFrame:1;
		const uint32_t reserved:19;
		volatile uint32_t rw_StandardIdentifier:11;
	}StandardIdentifier;

}CAN_TX_MAILBOX_IDENTIFIER;

typedef struct {
	volatile uint32_t rw_DataLen_InBytes:4; //0 to 8 Bytes
	const uint32_t reserved0:4;
	volatile uint32_t transmit_GlobalTime:1;
	const uint32_t reserved1:7;
	volatile uint32_t rw_MessageTimeStamp:16;
}CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP; // Alternate (446) Version below

/** ALTERNATIVE FOR STM32F446
typedef struct {
	volatile uint32_t rw_DataLen_InBytes:4;
	const uint32_t reserved:12;
	volatile uint32_t rw_MessageTimeStamp:16;
}CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP;
**/

typedef union {
	struct {
		volatile uint32_t rw_DataByte0:8;
		volatile uint32_t rw_DataByte1:8;
		volatile uint32_t rw_DataByte2:8;
		volatile uint32_t rw_DataByte3:8;
	};
	uint8_t dataIterator[4];
}CAN_TX_MAILBOX_DATALOW;

typedef union {
	struct {
		volatile uint32_t rw_DataByte4:8;
		volatile uint32_t rw_DataByte5:8;
		volatile uint32_t rw_DataByte6:8;
		volatile uint32_t rw_DataByte7:8;
	};
	uint8_t dataIterator[4];

}CAN_TX_MAILBOX_DATAHIGH;

typedef struct {
	struct {
		const uint32_t reserved0:1;
		volatile uint32_t enable_RemoteFrame:1;
		volatile uint32_t enable_ExtendedIdentifier:1;
		volatile uint32_t read_ExtendedIdentifier:26;
		const uint32_t reserved1:3;
	}ExtendedIdentifier;

	struct {
		const uint32_t reserved0:1;
		volatile uint32_t enable_RemoteFrame:1;
		const uint32_t reserved1:19;
		volatile uint32_t read_StandardIdentifier:11;
	}StandardIdentifier;
}CAN_RX_MAILBOX_IDENTIFIER;

typedef struct {
	volatile uint32_t read_DataLen_InBytes:4;
	const uint32_t reserved0:4;
	volatile uint32_t read_IdentifierFilterMatchIndex:8;
	volatile uint32_t read_MessageTimeStamp:16;
}CAN_RX_MAILBOX_DATALENCNTRL_TIMESTAMP;

typedef union {
	struct {
		volatile uint32_t read_DataByte0:8;
		volatile uint32_t read_DataByte1:8;
		volatile uint32_t read_DataByte2:8;
		volatile uint32_t read_DataByte3:8;
	};

	uint8_t dataIterator[4];
	
}CAN_RX_MAILBOX_DATALOW;

typedef union {
	struct {
		volatile uint32_t read_DataByte4:8;
		volatile uint32_t read_DataByte5:8;
		volatile uint32_t read_DataByte6:8;
		volatile uint32_t read_DataByte7:8;
	};

	uint8_t dataIterator[4];
	
}CAN_RX_MAILBOX_DATAHIGH;



//FILTER REGISTERS--------------------------------------------------------
typedef struct {
	volatile uint32_t filterActive0_filterReadyToInitialize1:1;
	const uint32_t reserved0:7;
	volatile uint32_t set_CAN2StartBank:6;
	const uint32_t reserved1:18;
}CAN_FILTER_MASTER;

typedef struct {
	volatile uint32_t filter0IDMaskMode0_filter0IDListMode1:1;
	volatile uint32_t filter1IDMaskMode0_filter1IDListMode1:1;
	volatile uint32_t filter2IDMaskMode0_filter2IDListMode1:1;
	volatile uint32_t filter3IDMaskMode0_filter3IDListMode1:1;
	volatile uint32_t filter4IDMaskMode0_filter4IDListMode1:1;
	volatile uint32_t filter5IDMaskMode0_filter5IDListMode1:1;
	volatile uint32_t filter6IDMaskMode0_filter6IDListMode1:1;
	volatile uint32_t filter7IDMaskMode0_filter7IDListMode1:1;
	volatile uint32_t filter8IDMaskMode0_filter8IDListMode1:1;
	volatile uint32_t filter9IDMaskMode0_filter9IDListMode1:1;
	volatile uint32_t filter10IDMaskMode0_filter10IDListMode1:1;
	volatile uint32_t filter11IDMaskMode0_filter11IDListMode1:1;
	volatile uint32_t filter12IDMaskMode0_filter12IDListMode1:1;
	volatile uint32_t filter13IDMaskMode0_filter13IDListMode1:1;
	volatile uint32_t filter14IDMaskMode0_filter14IDListMode1:1;
	volatile uint32_t filter15IDMaskMode0_filter15IDListMode1:1;
	volatile uint32_t filter16IDMaskMode0_filter16IDListMode1:1;
	volatile uint32_t filter17IDMaskMode0_filter17IDListMode1:1;
	volatile uint32_t filter18IDMaskMode0_filter18IDListMode1:1;
	volatile uint32_t filter19IDMaskMode0_filter19IDListMode1:1;
	volatile uint32_t filter20IDMaskMode0_filter20IDListMode1:1;
	volatile uint32_t filter21IDMaskMode0_filter21IDListMode1:1;
	volatile uint32_t filter22IDMaskMode0_filter22IDListMode1:1;
	volatile uint32_t filter23IDMaskMode0_filter23IDListMode1:1;
	volatile uint32_t filter24IDMaskMode0_filter24IDListMode1:1;
	volatile uint32_t filter25IDMaskMode0_filter25IDListMode1:1;
	volatile uint32_t filter26IDMaskMode0_filter26IDListMode1:1;
	volatile uint32_t filter27IDMaskMode0_filter27IDListMode1:1;
	const uint32_t reserved:4;
}CAN_FILTER_MODE;

