JazzJackson0/Embedded-Library/STM32F407-STM32F446/Drivers/STM32F407.CAN.h
typedef struct {
	volatile uint32_t filter0Size16B0_filter0Size32B1:1;
	volatile uint32_t filter1Size16B0_filter1Size32B1:1;
	volatile uint32_t filter2Size16B0_filter2Size32B1:1;
	volatile uint32_t filter3Size16B0_filter3Size32B1:1;
	volatile uint32_t filter4Size16B0_filter4Size32B1:1;
	volatile uint32_t filter5Size16B0_filter5Size32B1:1;
	volatile uint32_t filter6Size16B0_filter6Size32B1:1;
	volatile uint32_t filter7Size16B0_filter7Size32B1:1;
	volatile uint32_t filter8Size16B0_filter8Size32B1:1;
	volatile uint32_t filter9Size16B0_filter9Size32B1:1;
	volatile uint32_t filter10Size16B0_filter10Size32B1:1;
	volatile uint32_t filter11Size16B0_filter11Size32B1:1;
	volatile uint32_t filter12Size16B0_filter12Size32B1:1;
	volatile uint32_t filter13Size16B0_filter13Size32B1:1;
	volatile uint32_t filter14Size16B0_filter14Size32B1:1;
	volatile uint32_t filter15Size16B0_filter15Size32B1:1;
	volatile uint32_t filter16Size16B0_filter16Size32B1:1;
	volatile uint32_t filter17Size16B0_filter17Size32B1:1;
	volatile uint32_t filter18Size16B0_filter18Size32B1:1;
	volatile uint32_t filter19Size16B0_filter19Size32B1:1;
	volatile uint32_t filter20Size16B0_filter20Size32B1:1;
	volatile uint32_t filter21Size16B0_filter21Size32B1:1;
	volatile uint32_t filter22Size16B0_filter22Size32B1:1;
	volatile uint32_t filter23Size16B0_filter23Size32B1:1;
	volatile uint32_t filter24Size16B0_filter24Size32B1:1;
	volatile uint32_t filter25Size16B0_filter25Size32B1:1;
	volatile uint32_t filter26Size16B0_filter26Size32B1:1;
	volatile uint32_t filter27Size16B0_filter27Size32B1:1;
	const uint32_t reserved:4;
}CAN_FILTER_SCALE;

typedef struct {
	volatile uint32_t filter0ToFIFO0_filter0ToFIFO1:1;
	volatile uint32_t filter1ToFIFO0_filter1ToFIFO1:1;
	volatile uint32_t filter2ToFIFO0_filter2ToFIFO1:1;
	volatile uint32_t filter3ToFIFO0_filter3ToFIFO1:1;
	volatile uint32_t filter4ToFIFO0_filter4ToFIFO1:1;
	volatile uint32_t filter5ToFIFO0_filter5ToFIFO1:1;
	volatile uint32_t filter6ToFIFO0_filter6ToFIFO1:1;
	volatile uint32_t filter7ToFIFO0_filter7ToFIFO1:1;
	volatile uint32_t filter8ToFIFO0_filter8ToFIFO1:1;
	volatile uint32_t filter9ToFIFO0_filter9ToFIFO1:1;
	volatile uint32_t filter10ToFIFO0_filter10ToFIFO1:1;
	volatile uint32_t filter11ToFIFO0_filter11ToFIFO1:1;
	volatile uint32_t filter12ToFIFO0_filter12ToFIFO1:1;
	volatile uint32_t filter13ToFIFO0_filter13ToFIFO1:1;
	volatile uint32_t filter14ToFIFO0_filter14ToFIFO1:1;
	volatile uint32_t filter15ToFIFO0_filter15ToFIFO1:1;
	volatile uint32_t filter16ToFIFO0_filter16ToFIFO1:1;
	volatile uint32_t filter17ToFIFO0_filter17ToFIFO1:1;
	volatile uint32_t filter18ToFIFO0_filter18ToFIFO1:1;
	volatile uint32_t filter19ToFIFO0_filter19ToFIFO1:1;
	volatile uint32_t filter20ToFIFO0_filter20ToFIFO1:1;
	volatile uint32_t filter21ToFIFO0_filter21ToFIFO1:1;
	volatile uint32_t filter22ToFIFO0_filter22ToFIFO1:1;
	volatile uint32_t filter23ToFIFO0_filter23ToFIFO1:1;
	volatile uint32_t filter24ToFIFO0_filter24ToFIFO1:1;
	volatile uint32_t filter25ToFIFO0_filter25ToFIFO1:1;
	volatile uint32_t filter26ToFIFO0_filter26ToFIFO1:1;
	volatile uint32_t filter27ToFIFO0_filter27ToFIFO1:1;
	const uint32_t reserved:4;
}CAN_FILTER_FIFO_ASSIGNMENT;

typedef struct {
	volatile uint32_t enable_Filter0:1;
	volatile uint32_t enable_Filter1:1;
	volatile uint32_t enable_Filter2:1;
	volatile uint32_t enable_Filter3:1;
	volatile uint32_t enable_Filter4:1;
	volatile uint32_t enable_Filter5:1;
	volatile uint32_t enable_Filter6:1;
	volatile uint32_t enable_Filter7:1;
	volatile uint32_t enable_Filter8:1;
	volatile uint32_t enable_Filter9:1;
	volatile uint32_t enable_Filter10:1;
	volatile uint32_t enable_Filter11:1;
	volatile uint32_t enable_Filter12:1;
	volatile uint32_t enable_Filter13:1;
	volatile uint32_t enable_Filter14:1;
	volatile uint32_t enable_Filter15:1;
	volatile uint32_t enable_Filter16:1;
	volatile uint32_t enable_Filter17:1;
	volatile uint32_t enable_Filter18:1;
	volatile uint32_t enable_Filter19:1;
	volatile uint32_t enable_Filter20:1;
	volatile uint32_t enable_Filter21:1;
	volatile uint32_t enable_Filter22:1;
	volatile uint32_t enable_Filter23:1;
	volatile uint32_t enable_Filter24:1;
	volatile uint32_t enable_Filter25:1;
	volatile uint32_t enable_Filter26:1;
	volatile uint32_t enable_Filter27:1;
	const uint32_t reserved:4;
}CAN_FILTER_ACTIVATION;

typedef struct {
	volatile uint32_t bit0_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit1_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit2_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit3_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit4_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit5_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit6_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit7_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit8_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit9_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit10_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit11_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit12_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit13_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit14_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit15_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit16_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit17_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit18_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit19_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit20_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit21_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit22_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit23_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit24_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit25_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit26_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit27_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit28_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit29_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit30_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit31_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit32_Expects0_Expects1OrMatch1:1;
}CAN_FILTERBANKi_REGISTERx;





#endif
